In [18]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame({
    'A': ['John', 'Boby', 'Mina', 'Peter', 'Nicky'],
    'B': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 24]
})

In [20]:
df

       A         B   C
0   John   Masters  27
1   Boby  Graduate  23
2   Mina  Graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [17]:
df.pivot_table(df, index=['A', 'B'])

                   C
A     B
Boby  Graduate  23.0
John  Masters   27.0
Mina  Graduate  21.0
Nicky Graduate  24.0
Peter Masters   23.0